Terraform Plan:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.gh_actions_assume_role_policy will be created
  + resource "aws_iam_policy" "gh_actions_assume_role_policy" {
      + arn         = (known after apply)
      + description = "Policy for GH Actions Assume Role"
      + id          = (known after apply)
      + name        = "gh-policy-stage-01"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.gh_actions_assume_role will be created
  + resource "aws_iam_role" "gh_actions_assume_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gh-actions-stage-role-01"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/iac_stage_infra_iam.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/iac_stage_infra_iam.tfplan"
stdout<<ghadelimiter_a8f232c5-7a53-4064-8466-6e624d4d7511

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.gh_actions_assume_role_policy will be created
  + resource "aws_iam_policy" "gh_actions_assume_role_policy" {
      + arn         = (known after apply)
      + description = "Policy for GH Actions Assume Role"
      + id          = (known after apply)
      + name        = "gh-policy-stage-01"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.gh_actions_assume_role will be created
  + resource "aws_iam_role" "gh_actions_assume_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gh-actions-stage-role-01"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/iac_stage_infra_iam.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/iac_stage_infra_iam.tfplan"

ghadelimiter_a8f232c5-7a53-4064-8466-6e624d4d7511
stderr<<ghadelimiter_d028b9c2-a2f5-4411-8d81-f99b500b243d

ghadelimiter_d028b9c2-a2f5-4411-8d81-f99b500b243d
exitcode<<ghadelimiter_bbe425fa-7605-4f44-ac8c-5d1aab3f5bfe
0
ghadelimiter_bbe425fa-7605-4f44-ac8c-5d1aab3f5bfe
```